---
title: AdvancedLossFactor
classe: Autodesk.Revit.DB.Lighting.AdvancedLossFactor
namespace: Autodesk.Revit.DB.Lighting
eredita: Autodesk.Revit.DB.Lighting.LossFactor
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# AdvancedLossFactor

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double BallastLossFactor { get; set; }` | `advancedLossFactor.BallastLossFactor` | Double |
| `Double LampLumenDepreciation { get; set; }` | `advancedLossFactor.LampLumenDepreciation` | Double |
| `Double LampTiltLossFactor { get; set; }` | `advancedLossFactor.LampTiltLossFactor` | Double |
| `Double LuminaireDirtDepreciation { get; set; }` | `advancedLossFactor.LuminaireDirtDepreciation` | Double |
| `Double SurfaceDepreciationLossFactor { get; set; }` | `advancedLossFactor.SurfaceDepreciationLossFactor` | Double |
| `Double TemperatureLossFactor { get; set; }` | `advancedLossFactor.TemperatureLossFactor` | Double |
| `Double VoltageLossFactor { get; set; }` | `advancedLossFactor.VoltageLossFactor` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```